rule password_spray_attack {
  meta:
    author = "HH"
    description = "Rule to detect password spray attacks"
    severity = "medium"

  events:
    $e1.metadata.vendor_name = "Microsoft"
    $e1.metadata.event_type = "USER_LOGIN"
    $e1.principal.hostname = $th
    $e1.target.user.userid = $tu
    $e1.security_result.action = "BLOCK"

  match: 
    $th over 30m


  condition:
    #tu > 15 // this works better at 10
}
