rule mitre_attack_T1021_002_windows_admin_share_basic {

  meta:
    author = "Google Cloud Security | HH"
    description = "Detect the use of net use for SMB/Windows admin shares"
    platform = "Windows"
    severity = "Low"
    
  events:

    $e1.metadata.event_type = "PROCESS_LAUNCH"
    $e1.target.process.command_line = /net.*use.*(C|ADMIN|IPC)\$/ nocase

    $e1.principal.user.userid = $targetuser
    $userID.graph.entity.user.userid  = $targetuser

    $userID.graph.metadata.entity_type = "USER"
    $userID.graph.entity.user.title != /intern/ nocase or
    $userID.graph.entity.user.department != /Information Technology/ nocase

  match:
    $targetuser over 5m


  condition:
    $e1 and $userID

}


//Lines 14 and 15 - It’s like writing down someone’s phone number on a piece of paper and then using that paper whenever you need to call that person later, instead of looking up their number again.
